Pandas é uma biblioteca de código aberto específica para ciência de dados. Ela traz um poder para análise de dados, uma série de ferramentas que torna mais fácil análises estatísticas, por exemplo, com funções prontas.

In [3]:
pip install pandas

Requirement already satisfied: pandas in c:\users\bianc\appdata\local\programs\python\python312\lib\site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\bianc\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bianc\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\bianc\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\bianc\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\bianc\appdata\local\programs\python\python312\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.2.1 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [4]:
import pandas as pd

In [5]:
data = {'Nome': ['Alice', 'João', 'Ana'], 'Idade': [25,30,35]}

Uso da função DataFrame

In [6]:
df = pd.DataFrame(data)
df

    Nome  Idade
0  Alice     25
1   João     30
2    Ana     35

Seleção de colunas

In [7]:
nomeColuna = df['Nome']
nomeColuna

0    Alice
1     João
2      Ana
Name: Nome, dtype: object

In [8]:
nomeColuna = df['Idade']
nomeColuna

0    25
1    30
2    35
Name: Idade, dtype: int64

Fatiamento de linhas

In [9]:
dfFatia = df[1:4]
dfFatia

   Nome  Idade
1  João     30
2   Ana     35

Condicional

In [10]:
dfCondicional = df[df['Idade'] > 30]
dfCondicional

  Nome  Idade
2  Ana     35

Inserindo novas informações no DataFrame

In [11]:
df['Salário'] = [5000, 3000, 7000]

In [12]:
df

    Nome  Idade  Salário
0  Alice     25     5000
1   João     30     3000
2    Ana     35     7000

Renomear uma coluna

In [13]:
df = df.rename(columns={'Idade': 'Anos'})
df

    Nome  Anos  Salário
0  Alice    25     5000
1   João    30     3000
2    Ana    35     7000

Remover uma coluna

In [14]:
df = df.drop('Salário', axis=1)
df

    Nome  Anos
0  Alice    25
1   João    30
2    Ana    35